package NormalKnowledge.Base;
/*
* 变量的存在都是需要通过各种方法块代码进行内存分配的;如果不分配就好比，没有怀小孩，你却给他起了个名字，小孩不存在，但这个实例对象以后便会存在了
* ===============================================================================
* 按位置划分:    1.成员变量（该变量的赋值，要么直接赋值，要么在构造器中赋值）
*                       1)实例变量/对象变量
*                       2)静态变量/类相关变量
*               2.局部变量
* ================================================================================
* 1.静态变量随着类加载而加载，在方法区中分配内存空间，并完成初始化
* 2.实例对象通过"new"这个关键字在JVM的堆内存中为其分配了内存空间，而其对象内的构造方法则是对其完成属性初始化
* */
public class 变量 {
}
